# 캐글 작업형1 모의고사 1회
[캐글 작업형1 모의고사 1회 링크](https://www.kaggle.com/code/agileteam/mock-exam1-type1-1-tutorial/notebook)

In [18]:
# 경고 메세지 숨기기
import warnings
warnings.filterwarnings("ignore")

## 1번
첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼의 결측치를 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼의 결측치를 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오
- 단, 소수점 첫째자리까지 구하시오 (둘째자리에서 반올림)

In [16]:
import pandas as pd
df = pd.read_csv("./Data/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [20]:
df_a = df[:int(len(df)*0.5)]
df_a['f1'] = df_a['f1'].fillna(df_a['f1'].median())
a_std = df_a['f1'].std()

df_b = df[int(len(df)*0.5):]
df_b['f1'] = df_b['f1'].fillna(df_b['f1'].max())
b_std = df_b['f1'].std()

result = a_std + b_std
print(round(result,1))

42.0

## 2번
'f4'컬럼을 기준 내림차순 정렬과 'f5'컬럼기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함
- 단 소수점 둘째자리까지 출력(셋째자리에서 반올림)

In [23]:
import pandas as pd
df = pd.read_csv("./Data/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

### 다중 조건 정렬을 사용

In [26]:
df = df.sort_values(["f4", "f5"], ascending=[False, True]).reset_index(drop=True)
df.loc[0:9, "f5"] = df.loc[0:9, "f5"].min()
result = df["f5"].mean()
print(round(result, 2))

53.63

## 3번
'age' 컬럼의 IQR방식을 이용한 이상치 개수와 표준편차*1.5방식을 이용한 이상치의 개수를 더하시오  
- IQR방식 : Q1 - 1.5 IQR, Q3 + 1.5 IQR에서 벗어나는 영역을 이상치라고 판단함 (Q1은 데이터의 25%, Q3는 데이터의 75% 지점임)  
- 표준편차1.5방식: 평균으로부터 '표준편차1.5'를 벗어나는 영역을 이상치라고 판단함

In [27]:
import pandas as pd
df = pd.read_csv("./Data/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

### 조건에 괄호 잘 해주기

In [34]:
# IQR 이용
q3 = df["age"].quantile(0.75)
q1 = df["age"].quantile(0.25)
IQR = q3 - q1
IQR_len = len(df[(df["age"] > q3 + 1.5 * IQR) | (df["age"] < q1 - 1.5 * IQR)])


# 표준편차 이용
std = df["age"].std()
mean = df["age"].mean()
std_len = len(df[(df["age"] > mean + 1.5 * std) | (df["age"] < mean - 1.5 * std)])

result = IQR_len + std_len
print(result)

14

---

# 캐글 모의고사 2회
[캐글 작업형1 모의고사 2회 링크](https://www.kaggle.com/code/agileteam/mock-exam2-type1-1-2)

## 1번
index가 짝수인 행만(0포함) 선택해 "petal width (cm)" 값을 모두 더하시오.

In [36]:
import pandas as pd

# data생성 코드(변경금지)
from sklearn.datasets import load_iris
dataset = load_iris()
data_df = pd.DataFrame(dataset.data, columns=dataset.feature_names )
data_df.to_csv("data.csv", index=False)
del data_df, dataset

# 초기 제공 코드
df = pd.read_csv("data.csv")
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

### iloc[::2, :] 를 이용 !

In [38]:
result = sum(df.iloc[::2, :]["petal width (cm)"])
print(result)

91.4

## 2번
city를 기준으로 'f1'컬럼의 그룹합을 더한 뒤 그 값이 가장 큰 인덱스 명을 구하시오

In [39]:
import pandas as pd
df = pd.read_csv("./Data/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [42]:
result = df.groupby("city")["f1"].sum().idxmax()
print(result)

경기

In [43]:
# print(df.groupby('city').sum().sort_values('f1', ascending=False).index[0])

경기

## 3번
f1 컬럼 중 결측치가 있는 데이터를 선택하고, 그 데이터의 f5 컬럼 중앙값을 구하시오

In [9]:
import pandas as pd
df = pd.read_csv("./Data/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [47]:
result = df[df["f1"].isnull()]["f5"].median()
print(result)

60.33982554